app/controllers/laptops_controller.rb

  def index
    @title= "Listado de laptops"
    unless params[:id].nil?
      begin
        laptop=Laptop.find(params[:id])
      rescue
        redirect_to laptops_path
      else
        redirect_to laptop
      end
    end
    if params[:estado] == '-1' or params[:estado].nil?
        @laptops = Laptop.paginate(:page=>params[:page], :per_page => 10, :order => "id asc")
---
SELECT * FROM `laptops` WHERE (`laptops`.user_id = 12)
SELECT * FROM `laptops`
SELECT count(*) AS count_all FROM `laptops` WHERE (`laptops`.user_id = 12)

  def show
    begin
      @laptop = Laptop.find(params[:id])
---
SELECT * FROM `laptops` WHERE (`laptops`.user_id = 12)

  def edit
    @laptop = Laptop.find(params[:id])
---
SELECT * FROM `laptops` WHERE (`laptops`.user_id = 12)

  def create
    @laptop = current_user.laptops.build(params[:laptop])
    @programas = @laptop.build_program(params[:program])
    if @laptop.save
---
INSERT INTO `laptops` (`created_at`, `contra`, `paquete`, `updated_at`, `total`, `color`, `usuario`, `user_id`, `modelo`, `defecto`, `estado`, `respaldo`, `comentarios`, `marca`) VALUES('2010-06-02 02:52:21', 'pendeja', 'avanzado', '2010-06-02 02:52:21', 200, 'rojo', 'perra', 4, 'inspiron', 'no jala', 'muerta', 0, 'no se', 'dell')

  def update
    @laptop = Laptop.find(params[:id])
    if @laptop.estado < 5 and params[:justUpdate] != '1'
    	@colaborador = Colaborator.new(params[:colaborator])
    	@colaborador.save
---
SELECT * FROM `laptops` WHERE (`laptops`.`id` = 1)
INSERT INTO `colaboradors` (`created_at`, `laptop_id`, `updated_at`, `user_id`, `status`) VALUES('2010-06-12 23:01:02', NULL, '2010-06-12 23:01:02', NULL, NULL)
INSERT INTO `colaborators` (`created_at`, `laptop_id`, `updated_at`, `user_id`, `status`) VALUES('2010-06-19 21:41:50', 1, '2010-06-19 21:41:50', 12, 'Terminada')