app/controllers/posts_controller.rb

INSERT INTO `posts` (`created_at`, `title`, `updated_at`, `publishedDate`, `content`) VALUES('2010-07-06 02:09:56', 'Bienvenidos al Format Fest', '2010-07-06 02:09:56', '2010-07-06 02:08:00', 'En este espacio podran pre-registrar sus laptops el format')
---
  def create
    @post = Post.new(params[:post])
    @post.update_attribute(:publishedDate, Time.now)
    if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
UPDATE `posts` SET `content` = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. \r\nProin venenatis consectetur nulla et ullamcorper. Ut at enim non nisi facilisis euismod. Phasellus faucibus vulputate urna sit amet hendrerit. Nulla sit amet facilisis eros. Donec ut massa nulla. Cras porttitor lobortis mauris, eu condimentum quam molestie vel. Aenean id pulvinar tortor. In eget purus lorem, a vulputate lacus. Sed sit amet eros erat, tempor imperdiet tortor. In hac habitasse platea dictumst. In sagittis tempus sem, id malesuada turpis viverra non. Maecenas tristique faucibus nisl id gravida. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Vestibulum urna diam, sollicitudin vitae adipiscing sit amet, accumsan at urna.', `updated_at` = '2010-07-06 02:50:28' WHERE `id` = 2
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])