app/controllers/users_controller.rb

  def index
    if params[:usuario] == "3"
      @title = "Listado de Administradores y Colaboradores"
      @users = User.paginate(:page => params[:page],:per_page=>10, :order => "id asc", :conditions => ['email LIKE ? AND admin = \'1\' or colaborator = \'1\'', "%#{params[:search]}%"])
---
SELECT * FROM `users` WHERE (email LIKE '%1%' OR id = '1') ORDER BY updated_at ASC

  def create
  @user = User.new(params[:user])
	  if @user.save
---
INSERT INTO `users` (`name`, `created_at`, `crypted_password`, `updated_at`, `admin`, `colaborator`, `nextel`, `client`, `password_salt`, `phone`, `persistence_token`, `career`, `schoolid`, `email`, `cel`) VALUES('Miguel Cervera', '2010-06-08 03:57:27', 'd9c52c56dd89d8663de5d07b38ebfcb52fb81968f7a4ce5e2f573980a7922ec8035b34cd09e0e25598a112318a06fc7c714d8431d25b3c52aa36d23ef578df44', '2010-06-08 03:57:27', 1, 0, '', 0, 'eCCzh0vhQM9PLrkwkZKP', '12', '763452d4b1323f8e2c5781dbabc2acf337d295d7d9ab77a5fdb56049a7c26c2d07579d72e383b51dcc99fd65438927e5c8489af360bc5c1a5723c15189e2f26c', 'ITC', '1234', 'mi_miguelangel@hotmail.com', '')

  def edit
  	if current_user.admin? or current_user.colaborator?
  		@user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '12') LIMIT 1

  def update
  @user = User.find(params[:id])

  	if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = '12') LIMIT 1
UPDATE `users` SET `updated_at` = '2010-06-26 16:37:05', `client` = 0, `crypted_password` = '306a8d8dd6859575ed8a890804c9c186f8bc42290c39a77042a99d422aa9e3d11e229e9136014d3f2ea5832bbaca21406f061c0a0208372c5d48644daefe8098', `password_salt` = 'a2bzMFnC8FqjIDJQGGzZ', `admin` = 1, `persistence_token` = '0aac045ee894acf7e7dbe38212370ebe996a69b5146359c46a08263a6e06825384ca684adadb6b3b95ac80e6732647d923967273b711ab9884c42371fc00e8b3' WHERE `id` = 2

  def show
  	if current_user.admin? or current_user.colaborator?
  		@user = User.find(params[:id])
  	else
  		@user = current_user
  	end

    @title = "#{@user.fname.capitalize} #{@user.lname.capitalize}"
    unless @user.colaborators.empty?
---
SELECT * FROM `users` WHERE (`users`.`id` = '12') LIMIT 1
SELECT * FROM `colaborators` WHERE (`colaborators`.user_id = 12)
SELECT count(*) AS count_all FROM `colaborators` WHERE (`colaborators`.laptop_id = 4)

  def destroy
  @user = User.find(params[:id])
  @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = '12') LIMIT 1
DELETE FROM `users` WHERE `id` = 2

  def show_admin
    if current_user.admin? or current_user.colaborator?
  		@user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1