app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '12') LIMIT 1
---
  def index
  @title = "No me creen"
  @users = User.find(:all)